<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"304729f115c3ef8f431276e16707ae6f1838380505dd296a055439ddb3508c19","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1303 at https://github.com/cal-itp/data-infra/actions/runs/20799357047","plan_out_hash":"05a7f698f68d1fb8ab40e96073bcff2a3f239b5f12a736a50c34fc7cee50380d","plan_hash":"9d7ec8b27c6eec27f9e1bffbe165c0aaec7d4e66821d6d5dd3e0c8e40751adf3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "AgIGYg==" -> (known after apply)
!~      detect_md5hash      = "+4puEf/Ho738P+fD579aiQ==" -> "different hash"
!~      generation          = 1765993228219047 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
!~      md5hash             = "+4puEf/Ho738P+fD579aiQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/transit_database/dimensions/int_transit_database__gtfs_datasets_dim.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/_stg_gtfs.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "G4i6cQ==" -> (known after apply)
!~      detect_md5hash      = "ZIoZ9F+deaRCzQBuJSITkA==" -> "different hash"
!~      generation          = 1751416668944451 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
!~      md5hash             = "ZIoZ9F+deaRCzQBuJSITkA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1303](https://github.com/cal-itp/data-infra/actions/runs/20799357047)